devdnl/dnx-rtos/src/system/drivers/i2c/stm32f4/i2c_lld.c
/*=========================================================================*//**
@file    i2c_lld.c

@author  Daniel Zorychta

@brief   This driver support I2C peripherals.

@note    Copyright (C) 2017  Daniel Zorychta <daniel.zorychta@gmail.com>

         This program is free software; you can redistribute it and/or modify
         it under the terms of the GNU General Public License as published by
         the Free Software Foundation and modified by the dnx RTOS exception.

         NOTE: The modification  to the GPL is  included to allow you to
               distribute a combined work that includes dnx RTOS without
               being obliged to provide the source  code for proprietary
               components outside of the dnx RTOS.

         The dnx RTOS  is  distributed  in the hope  that  it will be useful,
         but WITHOUT  ANY  WARRANTY;  without  even  the implied  warranty of
         MERCHANTABILITY  or  FITNESS  FOR  A  PARTICULAR  PURPOSE.  See  the
         GNU General Public License for more details.

         Full license text is available on the following file: doc/license.txt.


*//*==========================================================================*/

// NOTE: 10-bit addressing mode is experimental and not tested!

/*==============================================================================
  Include files
==============================================================================*/
#include "drivers/driver.h"
#include "stm32f4/i2c_cfg.h"
#include "stm32f4/stm32f4xx.h"
#include "i2c_ioctl.h"
#include "i2c.h"
#include "lib/stm32f4xx_rcc.h"

/*==============================================================================
  Local symbolic constants/macros
==============================================================================*/
#define USE_DMA ((_I2C1_USE_DMA > 0) || (_I2C2_USE_DMA > 0) || (_I2C3_USE_DMA > 0))

/*==============================================================================
  Local types, enums definitions
==============================================================================*/
/// type defines configuration of single I2C peripheral
typedef struct {
    #if USE_DMA > 0
        const bool                use_DMA;              //!< peripheral uses DMA and IRQ (true), or only IRQ (false)
        const DMA_Stream_TypeDef *const DMA_tx;         //!< pointer to the DMA Tx channel peripheral
        const DMA_Stream_TypeDef *const DMA_rx;         //!< pointer to the DMA Rx channel peripheral
        const u8_t                DMA_tx_number;        //!< number of channel of DMA Tx
        const u8_t                DMA_rx_number;        //!< number of channel of DMA Rx
        const u8_t                DMA_channel;          //!< DMA channel number
        const IRQn_Type           DMA_tx_IRQ_n;         //!< number of interrupt in the vector table
        const IRQn_Type           DMA_rx_IRQ_n;         //!< number of interrupt in the vector table
    #endif
        const I2C_TypeDef        *const I2C;            //!< pointer to the I2C peripheral
        const u32_t               freq;                 //!< peripheral SCL frequency [Hz]
        const u32_t               APB1ENR_clk_mask;     //!< mask used to enable I2C clock in the APB1ENR register
        const IRQn_Type           IRQ_EV_n;             //!< number of event IRQ vector
        const IRQn_Type           IRQ_ER_n;             //!< number of error IRQ vector
} I2C_info_t;

/*==============================================================================
  Local function prototypes
==============================================================================*/
static inline I2C_TypeDef *get_I2C(I2C_dev_t *hdl);
static void clear_send_address_event(I2C_dev_t *hdl);
static void IRQ_EV_handler(u8_t major);
static void IRQ_ER_handler(u8_t major);

/*==============================================================================
  Local object definitions
==============================================================================*/
/// peripherals configuration
static const I2C_info_t I2C_INFO[_I2C_NUMBER_OF_PERIPHERALS] = {
        #if defined(RCC_APB1ENR_I2C1EN)
        {
                #if USE_DMA > 0
                .use_DMA          = _I2C1_USE_DMA,
                .DMA_tx           = DMA1_Stream6,
                .DMA_rx           = DMA1_Stream7,
                .DMA_tx_number    = 6,
                .DMA_rx_number    = 5,
                .DMA_channel      = 1,
                .DMA_tx_IRQ_n     = DMA1_Stream6_IRQn,
                .DMA_rx_IRQ_n     = DMA1_Stream5_IRQn,
                #endif
                .I2C              = I2C1,
                .freq             = _I2C1_FREQUENCY,
                .APB1ENR_clk_mask = RCC_APB1ENR_I2C1EN,
                .IRQ_EV_n         = I2C1_EV_IRQn,
                .IRQ_ER_n         = I2C1_ER_IRQn,
        },
        #endif
        #if defined(RCC_APB1ENR_I2C2EN)
        {
                #if USE_DMA > 0
                .use_DMA          = _I2C2_USE_DMA,
                .DMA_tx           = DMA1_Stream7,
                .DMA_rx           = DMA1_Stream3,
                .DMA_tx_number    = 7,
                .DMA_rx_number    = 3,
                .DMA_channel      = 7,
                .DMA_tx_IRQ_n     = DMA1_Stream7_IRQn,
                .DMA_rx_IRQ_n     = DMA1_Stream3_IRQn,
                #endif
                .I2C              = I2C2,
                .freq             = _I2C2_FREQUENCY,
                .APB1ENR_clk_mask = RCC_APB1ENR_I2C2EN,
                .IRQ_EV_n         = I2C2_EV_IRQn,
                .IRQ_ER_n         = I2C2_ER_IRQn,
        },
        #endif
        #if defined(RCC_APB1ENR_I2C3EN)
        {
                #if USE_DMA > 0
                .use_DMA          = _I2C3_USE_DMA,
                .DMA_tx           = DMA1_Stream4,
                .DMA_rx           = DMA1_Stream2,
                .DMA_tx_number    = 4,
                .DMA_rx_number    = 2,
                .DMA_channel      = 3,
                .DMA_tx_IRQ_n     = DMA1_Stream4_IRQn,
                .DMA_rx_IRQ_n     = DMA1_Stream2_IRQn,
                #endif
                .I2C              = I2C3,
                .freq             = _I2C3_FREQUENCY,
                .APB1ENR_clk_mask = RCC_APB1ENR_I2C3EN,
                .IRQ_EV_n         = I2C3_EV_IRQn,
                .IRQ_ER_n         = I2C3_ER_IRQn,
        },
        #endif
};

/*==============================================================================
  Exported object definitions
==============================================================================*/

/*==============================================================================
  Function definitions
==============================================================================*/
//==============================================================================
/**
 * @brief  Returns I2C address of current device
 * @param  hdl          device handle
 * @return I2C peripheral address
 */
//==============================================================================
static inline I2C_TypeDef *get_I2C(I2C_dev_t *hdl)
{
        return const_cast(I2C_TypeDef*, I2C_INFO[hdl->major].I2C);
}

//==============================================================================
/**
 * @brief  Clear all DMA IRQ flags (of tx and rx)
 * @param  major        peripheral major number
 * @return None
 */
//==============================================================================
#if USE_DMA > 0
static void clear_DMA_IRQ_flags(u8_t major)
{
        I2C_info_t         *cfg    = const_cast(I2C_info_t*, &I2C_INFO[major]);
        DMA_Stream_TypeDef *DMA_tx = const_cast(DMA_Stream_TypeDef*, cfg->DMA_tx);
        DMA_Stream_TypeDef *DMA_rx = const_cast(DMA_Stream_TypeDef*, cfg->DMA_rx);

        static const struct {
                __IO u32_t *IFCR;
                u32_t       mask;
        } flag[] = {
                    {.IFCR = &DMA1->LIFCR, .mask = (DMA_LIFCR_CFEIF0 | DMA_LIFCR_CDMEIF0 | DMA_LIFCR_CTEIF0 | DMA_LIFCR_CHTIF0 | DMA_LIFCR_CTCIF0)},
                    {.IFCR = &DMA1->LIFCR, .mask = (DMA_LIFCR_CFEIF1 | DMA_LIFCR_CDMEIF1 | DMA_LIFCR_CTEIF1 | DMA_LIFCR_CHTIF1 | DMA_LIFCR_CTCIF1)},
                    {.IFCR = &DMA1->LIFCR, .mask = (DMA_LIFCR_CFEIF2 | DMA_LIFCR_CDMEIF2 | DMA_LIFCR_CTEIF2 | DMA_LIFCR_CHTIF2 | DMA_LIFCR_CTCIF2)},
                    {.IFCR = &DMA1->LIFCR, .mask = (DMA_LIFCR_CFEIF3 | DMA_LIFCR_CDMEIF3 | DMA_LIFCR_CTEIF3 | DMA_LIFCR_CHTIF3 | DMA_LIFCR_CTCIF3)},
                    {.IFCR = &DMA1->HIFCR, .mask = (DMA_HIFCR_CFEIF4 | DMA_HIFCR_CDMEIF4 | DMA_HIFCR_CTEIF4 | DMA_HIFCR_CHTIF4 | DMA_HIFCR_CTCIF4)},
                    {.IFCR = &DMA1->HIFCR, .mask = (DMA_HIFCR_CFEIF5 | DMA_HIFCR_CDMEIF5 | DMA_HIFCR_CTEIF5 | DMA_HIFCR_CHTIF5 | DMA_HIFCR_CTCIF5)},
                    {.IFCR = &DMA1->HIFCR, .mask = (DMA_HIFCR_CFEIF6 | DMA_HIFCR_CDMEIF6 | DMA_HIFCR_CTEIF6 | DMA_HIFCR_CHTIF6 | DMA_HIFCR_CTCIF6)},
                    {.IFCR = &DMA1->HIFCR, .mask = (DMA_HIFCR_CFEIF7 | DMA_HIFCR_CDMEIF7 | DMA_HIFCR_CTEIF7 | DMA_HIFCR_CHTIF7 | DMA_HIFCR_CTCIF7)},
        };

        *flag[cfg->DMA_tx_number].IFCR = flag[cfg->DMA_tx_number].mask;
        *flag[cfg->DMA_rx_number].IFCR = flag[cfg->DMA_rx_number].mask;

        CLEAR_BIT(DMA_tx->CR, DMA_SxCR_EN);
        CLEAR_BIT(DMA_rx->CR, DMA_SxCR_EN);
}
#endif

//==============================================================================
/**
 * @brief  Function handle error (try make the interface working)
 * @param  hdl          device handle
 * @return None
 */
//==============================================================================
static void reset(I2C_dev_t *hdl, bool reinit)
{
        I2C_TypeDef *i2c = get_I2C(hdl);

